wrtier_task_prompt = """
אתה תקבל כתבה של עיתון בעברית. המשימה שלך היא למצוא את שם הכותב של הכתבה. שם הכותב מופיע בדרך כלל בתחילת הכתבה, ואם לא אז בסוף הכתבה. עליך להחזיר את השם הפרטי ושם המשפחה של הכותב בלבד, בלי שום תוספת של טקסט נוסף בתשובה.
"""
categories = [
    "חדשות מקומיות",
    "חדשות בינלאומיות",
    "פוליטיקה",
    "כלכלה ופיננסים",
    "טכנולוגיה",
    "מדע",
    "בריאות",
    "חינוך",
    "תרבות ובידור",
    "מוזיקה",
    "קולנוע",
    "ספרות",
    "אמנות",
    "ספורט",
    "טור דעה",
    "ראיונות",
    "אופנה",
    "מזג אוויר",
    "נסיעות ותיירות",
    "אוכל ובישול",
    "פלילים ומשפט",
    "נדל\"ן",
    "תחבורה",
    "אחר"
]
classificator_task_prompt = """
אתה תקבל כתבה של עיתון בעברית. המשימה שלך היא לקבוע לאיזו קטגוריה מבין הקטגוריות הבאות משתייכת הכתבה: חדשות מקומיות, חדשות בינלאומיות, פוליטיקה, כלכלה ופיננסים, טכנולוגיה, מדע, בריאות, חינוך, תרבות ובידור, מוזיקה, קולנוע, ספרות, אמנות, ספורט, טור דעה, ראיונות, אופנה, מזג אוויר, נסיעות ותיירות, אוכל ובישול, פלילים ומשפט, נדל"ן, תחבורה, או אחר (אם לא שייך לאף קטגוריה). החזר את הקטגוריה המתאימה בלבד, בלי שום תוספת של טקסט נוסף בתשובה.
"""